<template>
  <div class="markdown-body main-container">
    <h1>CodeReview 用户协议</h1>
    <p>欢迎您来到CodeReview</p>
    <p>请您仔细阅读以下条款，如果您对本协议的任何条款表示异议，您可以选择不进入CodeReview。当您注册成功，无论是进入CodeReview，还是在CodeReview上发布任何内容，或者是直接或通过各类方式（如站外API引用等）间接使用CodeReview网服务和数据的行为，都将被视作已无条件接受本声明所涉全部内容。</p>
    <p>若您对本声明的任何条款有异议，请停止使用CodeReview网所提供的全部服务。</p>
    <h4>一、使用规则</h4>
    <p>1、用户注册成功后，CodeReview将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。</p>
    <p>2、用户须对在CodeReview的注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义发布任何信息；不得恶意使用注册帐号导致其他用户误认；否则CodeReview有权立即停止提供服务，收回其帐号并由用户独自承担由此而产生的一切法律责任。</p>
    <p>3、CodeReview是一个信息分享及传播的平台。用户通过CodeReview发表的信息为公开的信息，其他第三方均可以通过CodeReview获取用户发表的信息，用户对任何信息的发表即认可该信息为公开的信息，并单独对此行为承担法律责任；任何用户不愿被其他第三人获知的信息都不应该在CodeReview上进行发表。</p>
    <p>4、用户承诺不得以任何方式利用CodeReview直接或间接从事违反中国法律、以及社会公德的行为，CodeReview有权对违反上述承诺的内容予以删除。</p>
    <p>5、CodeReview用户不得利用CodeReview服务制作、上载、复制、发布、传播或者转载如下内容：</p>
    <div style="padding-left: 10px;">
        <p>（1）遵守中国法律、法规、行政规章及规范性文件；</p>
        <p>（2）遵守公司所有与见招服务有关的协议、规定、程序、通知、使用守则等全部文件；</p>
        <p>（3）不得为任何违法、犯罪目的而使用服务；</p>
        <p>（4）不得以任何形式使用见招服务侵犯公司的合法权利；</p>
        <p>（5）不得利用服务进行任何可能对互联网正常运转造成不利影响的行为</p>
        <p>（6）不得利用公司提供的服务制作、上传、复制、发布或传播任何虚假的、骚扰性的、中伤他人的、种族歧视性的、辱骂性的、恐吓性的、情色的或其他任何法律、行政法规和政策禁止的内容；</p>
        <p>（7）不得以任何方式侵犯其他任何人依法享有的专利权、著作权、商标权、商业秘密等知识产权，第三人的名誉权或其他任何第三方的合法权益。</p>
    </div>
    <p>6、CodeReview有权对用户使用CodeReview的情况进行审查和监督，如用户在使用CodeReview时违反任何上述规定，CodeReview或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容、暂停或终止用户使用CodeReview的权利）以减轻用户不当行为造成的影响。</p>
    <h4>二、知识产权</h4>
    <h5>CodeReview是一个信息获取、分享及传播的平台，我们尊重和鼓励CodeReview用户创作的内容，认识到保护知识产权对CodeReview生存与发展的重要性，承诺将保护知识产权作为CodeReview运营的基本原则之一。</h5>
    <p>1、用户在CodeReview上发表的全部原创内容，著作权均归用户本人所有。用户可授权第三方以任何方式使用，不需要得到CodeReview的同意。</p>
    <p>2、CodeReview提供的网络服务中包含的标识、版面设计、排版方式、文本、图片、图形等均受著作权、商标权及其它法律保护，未经相关权利人（含CodeReview及其他原始权利人）同意，上述内容均不得在任何平台被直接或间接发布、使用、出于发布或使用目的的改写或再发行，或被用于其他任何商业目的。</p>
    <p>3、为了促进其创作内容的分享和传播，用户将其在CodeReview上发表的全部内容，授予CodeReview免费的、不可撤销的、非独家使用许可，CodeReview有权将该内容用于CodeReview各种形态的产品和服务上，包括但不限于网站以及发表的应用或其他互联网产品。
        <br> 第三方若出于非商业目的，将用户在CodeReview上发表的内容转载在CodeReview之外的地方，应当在作品的正文开头的显著位置注明原作者姓名（或原作者在CodeReview上使用的帐号名称），给出原始链接，注明「发表于CodeReview」，并不得对作品进行修改演绎。若需要对作品进行修改，或用于商业目的，第三方应当联系用户获得单独授权，按照用户规定的方式使用该内容。
    </p>
    <p>4、CodeReview为用户提供「保留所有权利，禁止转载」的选项。除非获得原作者的单独授权，并邮件通知CodeReview（邮箱：contact@jianshu.com），任何第三方不得转载标注了「禁止转载」的内容，否则均视为侵权。</p>
    <p>5、在CodeReview上传或发表的内容，用户应保证其为著作权人或已取得合法授权，并且该内容不会侵犯任何第三方的合法权益。如果第三方提出关于著作权的异议，CodeReview有权根据实际情况删除相关的内容有权追究用户的法律责任，给CodeReview或任何第三方造成损失的，用户应负责全额赔偿。</p>
    <p>6、如果任何第三方侵犯了CodeReview用户相关的权利，用户同意授权CodeReview或其指定的代理人代表CodeReview自身或用户对该第三方提出警告、投诉、发起行政执法、诉讼、进行上诉，或谈判和解，并且用户同意在CodeReview认为必要的情况下参与共同维权。</p>
    <p>7、CodeReview有权但无义务对用户发布的内容进行审核，有权根据相关证据结合《侵权责任法》、《信息网络传播权保护条例》等法律法规及CodeReview社区指导原则对侵权信息进行处理。</p>
    <h4>三、个人隐私</h4>
    <p>尊重用户个人隐私信息的私有性是CodeReview的一贯原则，CodeReview将通过技术手段、强化内部管理等办法充分保护用户的个人隐私信息，除法律或有法律赋予权限的政府部门要求或事先得到用户明确授权等原因外，CodeReview保证不对外公开或向第三方透露用户个人隐私信息，或用户在使用服务时存储的非公开内容。</p>
    <p>同时，为了运营和改善CodeReview的技术与服务，CodeReview将可能会自行收集使用或向第三方提供用户的非个人隐私信息，这将有助于CodeReview向用户提供更好的用户体验和服务质量。</p>
    <h4>四、侵权举报</h4>
    <p>1、处理原则
    </p>
    <p>CodeReview高度重视自由表达和企业正当权利的平衡。依照法律规定删除违法信息是CodeReview社区的法定义务，CodeReview社区亦未与任何中介机构合作开展此项业务。</p>
    <p>2、受理范围</p>
    <p>受理CodeReview社区内侵犯企业或个人合法权益的侵权举报，包括但不限于涉及个人隐私、造谣与诽谤、商业侵权。 涉及个人隐私：发布内容中直接涉及身份信息，如个人姓名、家庭住址、身份证号码、工作单位、私人电话等详细个人隐私； 造谣、诽谤：发布内容中指名道姓（包括自然人和企业）的直接谩骂、侮辱、虚构中伤、恶意诽谤等； 商业侵权：泄露企业商业机密及其他根据保密协议不能公开讨论的内容。</p>
    <p>3、举报条件</p>
    <p>如果个人或单位发现CodeReview上存在侵犯自身合法权益的内容，请与CodeReview取得联系（邮箱：contact@codereview.com）。为了保证问题能够及时有效地处理，请务必提交真实有效、完整清晰的材料，否则不予受理。请使用以下格式（包括各条款的序号）：</p>
    <div style="padding-left: 10px;">
        <p>A、权利人对涉嫌侵权内容拥有商标权、著作权和/或其他依法可以行使权利的权属证明；如果举报人非权利人，请举报人提供代表企业进行举报的书面授权证明。</p>
        <p>B、充分、明确地描述侵犯了权利人合法权益的内容，提供涉嫌侵权内容在CodeReview上的具体页面地址，指明涉嫌侵权内容中的哪些内容侵犯了上述列明的权利人的合法权益；</p>
        <p>C、权利人具体的联络信息，包括姓名、身份证或护照复印件（对自然人）、单位登记证明复印件（对单位）、通信地址、电话号码、传真和电子邮件；</p>
        <p>D、在侵权举报中加入如下关于举报内容真实性的声明：
            <br> · 我本人为所举报内容的合法权利人；
            <br> · 我举报的发布在CodeReview社区中的内容侵犯了本人相应的合法权益；
            <br> · 如果本侵权举报内容不完全属实，本人将承担由此产生的一切法律责任。
            <br>
        </p>
    </div>
    <p>4、处理流程</p>
    <p>出于网络社区的监督属性，并非所有申请都必须受理。CodeReview自收到举报邮件七个工作日内处理完毕并给出回复。处理期间，不提供任何电话、邮件及其他方式的查询服务。
        <br> 出现CodeReview已经删除或处理的内容，但是百度、谷歌等搜索引擎依然可以搜索到的现象，是因为百度、谷歌等搜索引擎自带缓存，此类问题CodeReview无权也无法处理，因此相关申请不予受理。
        <br> 此为CodeReview社区唯一的官方的侵权投诉渠道，暂不提供其他方式处理此业务。 用户在CodeReview中的商业行为引发的法律纠纷，由交易双方自行处理，与CodeReview无关。
    </p>
    <h4>五、服务终止及暂停</h4>
    <p>任何引起其他用户反感的行为，包括但不限于利用CodeReview平台发布广告或是垃圾信息，利用简信骚扰其他用户等，网站可随时行使暂停、收回、删除帐号的权利。</p>
    <h4>六、其他免责声明</h4>
    <p>1、用户在CodeReview发表的内容仅表明其个人的立场和观点，并不代表CodeReview的立场或观点。作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。CodeReview不承担任何法律及连带责任。</p>
    <p>2、CodeReview不保证网络服务一定能满足用户的要求，也不保证网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作保证。</p>
    <p>3、对于因不可抗力或CodeReview不能控制的原因造成的网络服务中断或其它缺陷，CodeReview不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>
    <h4>七、协议修改</h4>
    <p>1、根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，CodeReview有权对本协议的条款作出修改或变更，一旦本协议的内容发生变动，CodeReview将会直接在CodeReview网站上公布修改之后的协议内容，该公布行为视为CodeReview已经通知用户修改内容。CodeReview也可采用电子邮件或私信的传送方式，提示用户协议条款的修改、服务变更、或其它重要事项。</p>
    <p>2、如果不同意CodeReview对本协议相关条款所做的修改，用户有权并应当停止使用CodeReview。如果用户继续使用CodeReview，则视为用户接受CodeReview对本协议相关条款所做的修改。</p>
  </div>
</template>

<script type="text/javascript">
  require('../../node_modules/github-markdown-css/github-markdown.css')
  export default {

  }
</script>

<style lang="stylus">
.main-container
    max-width: 700px;
    margin-top: 60px;
    margin-bottom: 60px;
.markdown-body
    h1
        text-align center
        font-family Raleway-Regular,Helvetica Neue,Helvetica,PingFang SC,Hiragino Sans GB,WenQuanYi Micro Hei,Arial,Microsoft Yahei,Verdana,sans-serif
        font-size 28px
</style>
